#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "aaafa64d20354f1bf151124136f76a33" -> "7a5bceff5809687c3164ab0ed6a147b6"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4df5d7691f52560d5955787679151191" -> "7710f83d6da2f06521c579e5abff8419"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "64cc325ec90ea68504f6b50ce4e4bca1" -> "9fec4e949b4448eb705b31da6906ed2f"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "86bb915513edd14a57fb91b44ae8d00d" -> "4e5816e3ab058771994122a500d49ef9"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "c341ae1bbffc22274fc31a7ea448ab8a" -> "b33b96506114cc377ad003a545e845bf"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "3c6e9c74c7061f747a2897412f75ad5a" -> "8835e0e37bdc7f1226c58a8e2c889a43"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "ffa60d5cb2b07049816975900d2214c4" -> "a7ee26a4d1d322bc7bde29df04d2e5f8"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "aaa32839d3b34c6ed5452595e1168ea8" -> "87226ea7800e94847a596c6f0f861775"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "e235172dd15cc7dd312aded7ba4acf21" -> "fb0dde3c9b47a7c51002891bb8c44042"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5dcac26e20635e5f5b08aa6fa74c64cc" -> "9d9f2f6d89733746efd245210766c920"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "6d05ece71b1b083336dbd8d607bdffa0" -> "36b25576a119fcd0b38a4212127a11ff"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "c00b7077af1fb38780c4395c6d2dd4be" -> "5449cb9ac97624a848b56e6a68232c06"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4cc374f6e5a8de89efaea95623f3bcb8" -> "342220bc160721650d19725f9225f071"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "475ad51a40f882cc715671a05d8c1853" -> "52cb3484e4dd1baeb0d6d67360f1cf9a"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a933cb2b456fa38064aca50158484aa5" -> "1a409bc8d3948e43da380ad6bf031f79"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "072df4221ffbc23687152072f2e09279" -> "5ff32e6cfe62a2782d4fd8a6d3c6dc39"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "9d9f43393edf63f563c65b968f0a2493" -> "104f9b03ce7ee31b91128086269352ff"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "1f123b0fd7f72c50f6b76afd0ece8375" -> "171be31da1aad224ecf56f56c0183df6"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "4c292f23bc02070b33992596f5fb1212" -> "bd61f662ee609d1bab88bffbe61f4b78"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8fbb1ec469b1fbb1edfb595bc18758e2" -> "a52e387f7ba7d16afca12f86ebff23ca"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "f77c0398f13d80e2f137e2c876ece89a" -> "a8e759f2f083a7e59da6e46631750f14"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "88a8d738041fcd274984ad230e0a863b" -> "2c8b16d520bbdc3f9b7df1966e4ee0c8"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6a9da0c1b445f9a7ff3e8720919779a9" -> "8a9c729cb6a5de2604e486bed5a6dce2"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "cbd9736418ca7a78ea4077cf089e1fb2" -> "70d818b1e69b9edbf517533c8502c60d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "040ae9d8f398d75bdf40a56b59309f64" -> "1002b769a2e40f03a2b131230ce7d1c3"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "792f2c860d44635bd57fec3e4291e91c" -> "24a56dd220724ec4568fb4c1b77b6236"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "39dc456180341cfcc1a1b066b545e4e4" -> "4eb92336cc13b9be9a7dd82f12d4def9"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6e00cf7d81217d3397f1fdcd5d2be01e" -> "4b351f1f7ba8b421fd75a6c9741b2065"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "33db68fb40e1aa9029b96862491da873" -> "bb25684d3a5cf51291ca01eb8f7d1859"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "fd061333ad6d2e461cda907bee49c220" -> "07bd583ceacb54e27682edd8c20b0da7"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "bfd8c737950516e1ddd28e1135c45565" -> "b9d7199dcf7a55170d1ad0134ec31c7c"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f7cd4d4c17d95f6c474584bbf3a9cf35" -> "dfe9a38147bb744b723fcd7ac38085c7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "474cf58c84c75e89f1137753d8234fc0" -> "2fe03080290ab6d58bb4a87613ae6587"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0bf87652b964b88327162abfb2439e70" -> "01959f0232b3ca12f6b1ee513c1ea7c0"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7b8c25db26188128d991076c12dfde4" -> "9b7f681b125d8ee829f93a9cdaf47b7a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5aeeecf18cdafd21dd0a0904a8266c37" -> "e6cecf5e0de12a438e48386ceebb61c1"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab19312ad691501a1ea42c977f891b53" -> "184edafdc0edba874da6a8f22bc8cd81"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "4d9c93dd3dca13a28707483429e987a1" -> "c79340335476eb5c6f8f8f4b03641ac9"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "cd1a93977d7edf03a63d39c93f641ddf" -> "6d7cdba0aa95ac18dd9a8af971000576"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0dfefd94f0fc486f2dd3155cfaee19dc" -> "7357c465eb8f3773e2ed7771ebff251f"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ce975857d3991c83ba090e543c582cbc" -> "26b36c2c4f9d830bd2e53535d03853c5"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "8ad1163529d160dd762b100389087af1" -> "dbe6a35d82adc9d2b7189b0a8df48c2c"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "a9818148d2fa3478936d5a2ac951aa58" -> "6e1651f37e9df38a5c68cef37ad371c6"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "ed026282f7638c4fb0da9964a8b4690b" -> "4603ed2479fa1535c16dd587d703c6f5"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4a12dff2f92a4c2591b073f3b4f9ba0d" -> "705467717a8e4a50f235a2f4c12f0046"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "dMJ2RYetyQOoHUnk7C1mb/Ycpc2FhXeegai4TyQDQyg=" -> "uAJeEpPmWRHFaHs+2T+aeauK7rH+QSkfp6S/jknU/7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Vflc/oDO1NaiARlJ79MCD+NZMpnm6RW1kte4kf+H7Y=" -> "RQjH1bIuJ/HGD7syoX6voYoL135HieMEvTAvu0I0TvY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pihLiUwQJu6AapPyWgxKNfK46ikiqY5+9WK5XEH8XX4=" -> "y+sTgPepFNEasvyWD2jRhbZyBhCrSSmNR5ZMj3l2IUQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZJF0NwOtbAvM7GM6KMWW7z9OYesOkNu4mKoh9YYxzg=" -> "R1qhuGKK1BqqVDiTm0f8m62RAXCOIUAX1Drvq1Ixpaw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "ifa6ecCsSSYmcPxGFQZaJwApiEMPJwLEJBuEcWJj1Bs=" -> "8zIoMhcCVyLsR4DTkcVeoIqo6LAbcc+a1sMStkyUWnk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "AiMC9UqpZAzTLmA/Gef9JslDtV/SePhz4rw5bos9yno=" -> "aObQsFlQdgUkpfLJOSc9c66hVf9LOrNe9ides9SNbdA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPx9aVzHTKz9OJA4giT1iviLi3M5mxx4YD2YIxzkXg=" -> "cpXYaj8PzgCPE+gdyhElnR+WjSdAz9XMy0xtCAHiq2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYpNueJAJ7l2Ni/a24CVJMwtTiwTrqdyh6rMpIUbZYk=" -> "oL6swE42PAx2xxDZceBHJI9HllzaoNTNI/mvX1YVk0Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "uOZ2MS/hPze5HVwEy+FbdJW5okfwP0e6GtDDgu3ClCQ=" -> "9Xb0o3Hm50ELLLhKKStTfnvzJm63xO5r7rrLUxb677Q="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "LoDD41PuGrhcx3LgRnB872bKkehuRJsoLBP3wSHjcCQ=" -> "Mmj+AU+Mk7iQhg1IjNcPj9BoMdIwUcAKpksEldqSH7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qtm5VrfPzAumb1aw2oMaSyQwLOIJqo+Tf8UJows4d1o=" -> "z9tBog8qraGU72efZP3xtfMahZnY/2VUcJ3Ts0Ea8cY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "S7mMfi6GGx9IJpBMAY4pyUDDqTQulRlJ6iPh8mitu+4=" -> "1dnTmvqSgBVPJKx57dydC42ZPm0JfZLXWV8Impc/tY0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "uigGW06hppx1vLtQxPYul/1c7Vm265YGax1V6fheCKI=" -> "EOaIEzCJh38zMVC1obeIVqDnuiLrFic+C7BpeSOimCg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "JPUQRHCHIqTevZW014IFiwqrKNoSWCQFCJaT/jCgSsk=" -> "DkeQ1kQVDaGNXlUPHNheOfrfoHTJls6Thbk9ITtln7k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cn/ClkTNO4cvcJ1ATyhiJa6GsDrg5CPsCrAvu1Whiyc=" -> "owFTVnoVHhogw5LnZp4elPBOwq9ijCfZz/a5+pyddZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWvfcdb+0PGXLOJaAsvY7dOosGaIAIslv7lbjyetZGI=" -> "8G3vq67AaQamJ/ilQhqGwls7fc9yZrBkdk9CVCTPjsM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVKBGrY9hRoK/I81vCNPnU6Bp8Cu4kjO5g94yXE6pyQ=" -> "4egEHuMndbhyQGBoZ9PgVxT5FKBi9YdUXJ13AYkp5/o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "SpQ/P45HZnwfaTaSfW0DNQLMpU+jeS2KVfiO4iWc0qg=" -> "4C88l5osbIs9LeKmi+LbG8DKcbdml0p/L34Lmow+Z5I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "K4CKRPND3HkYc+VAxoMw10LTt/JadOIlt6n1MP0Enkc=" -> "hMYnmGJioN06dqgV41skv72Ezyec6dckVbaWOxzKBNs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Qt6IiwTHFJP/w9ayWZDDsAdTo+YGanaNmLeJEOcW1UE=" -> "2osXu/29Ow8HAkK2bTBHZIjn97zQ0Moa5r+YlEVwAAk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mk/6A4ma0TB6i+uAYmE6J6AOozGoadGvXnDSVYfJaJ0=" -> "dODk3g9c092Ypv8xBDhytceoxiKdHPCwatqhxeEkLtg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EvAvj2UeUZy9E2s9RZcvIu/3QbXng/It33Arh6VrYtc=" -> "kf1v+eyCXDLMMGhrdK6Ll0apRCozkL99wguak2d0770="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "FUxZsh/66ln0GO8eRoywNiReMtBunldgcgyLsoX1P6k=" -> "5yDBm8BA4WSk7DAGKEhQyzlbgJraUM2NKV80dHyuJuI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zm40WvcsB9TNc/n/lLSNIzuONtiUMmDPcTUPEMdmnIk=" -> "O67QdSqin+LcGkfW3zrjNW/lA0eknU+wJMSxJgSqtGQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFRHKuAI8DwuegERcWoPyFt5hvOkCpmoarHeGqE4Rrg=" -> "9hBDjq/kBMXYosLQS8BM+Q3X0h7AMtKVSKZiUKzX8Fs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "bWKYETVYBmKnhNR7UdgHbkGTJKc7+accvklEwPn/Hnk=" -> "1M2F3+EegZZiFqnFOwVc3L6aPsMpL6+kftUsKLmB7TY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ez+qbKyzvqpGbmFUsAA7uQe9AYt49tYhNK2cZl5uuB4=" -> "GGPBhNr4NRSbgbme+AZhgC1Jqzqz1dy9cctrrXsGNYY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo2UWO11JBGnwI+S/V00/bq2zKztDAbL6s2drtLe6qo=" -> "z8R/6V/j1uflNfEhgcQaC6AFNC7RERyNlX/l+Xn/mQ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "CpN7kXf5BUpDhjbkhsq7h7C3MBzf6QH6tYkjgmGLRB4=" -> "ReqEAsqaqZvbO9Cm6bOulet1+BuEZJEqaYeCOEJtGzQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TayHhkgRq08oBb8vvpKuLWrDhXCys7lMn9WX1DwhK0I=" -> "VjTx7OI/4lfGRCAow0AXtODbAigZ+ntLBAM5Zq0NoD4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5N6rh+9in1mbdi3B54s/pLEbkFYy6HaX5epBIC4QYxI=" -> "+DUMVrf0R7UH4oNZU5nVpznqMXGcWARUkBa7bWYGzGQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "L84tKCG1qsTT7lE/qaD+GXHvZvX8lYZy1/Kl/WeVnpI=" -> "mbOeH6BVxloEof+fwvOI3EyrMvD9wxJrcJrURZegJ5s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "icQ4SD6Z0Rzv+Ao1v0YatTXbtWGAKir649AUhOW6rJs=" -> "2z/EBxPnAq806ztny3G6Bg3oSlvJ6aTmoEc1GgQZOD0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XDV7p7EFXK7uUyWKrqqC7yRCGY2Wz37PHw5u/rgTTGQ=" -> "F5MVUZjHvG5dk5rffFeoFcvGSbjktZsvlUhCBaXl5kg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "3M1Cj9yZ81J8DyA1hLr4W9tGOTpDZ1bYAp/jtrJ8vqc=" -> "QxQftR6b9asw81sPXeFyGV6fEA688PVswW/q6cP0XvM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "WTQ3fdHgGUAUsf/cJCk5sZBpsxTXruVgqitFqUqe44I=" -> "s/cBmvD8/w3WlB03JufqGYX9CzawF4uZa2V3K3XTaKs="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "hEd7mdbyJzq9Q4TrdZkvTjd6c/9LE5NNqvVJPwWA480=" -> "xhWTYmwlNVWrEsUu7kcFS0OJy1UN7NmBiPMdzwpr3NI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "B5dRypOnUx0Kw+aRB1XcwvyBA+fs3cBlSC66Sdp4+wA=" -> "LUcvsLv7ooH1oGKhcNJdKvGmGaEl2YZUOFV6s1Hz+zc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ISTmuW3opF9ke6bTCLv3qInFZgiMI0TXtYyLa7H7xu0=" -> "WW/WsZI+1+2DKeQ9TwuWPkI/nNM0/S7OI0J/JLfP0hM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "+GdiKRF6JkyixBnptQEFbdEwQ1aARI2YWWZOoG7mc/g=" -> "e0J9H58n6Kx70o9/T2kmIbs/PHvqrkqowHtVt14eMcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "2pBtKLBB4TJm2OYYC6MFDTiXTl//uP5wN3uwfbL3MSs=" -> "niMpaiRNW8w3D8zyf9T1fLIJ6Jl8jodv00Oi3VHh3xw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ALCqK5jK2Ms+4Cq/ZaGIM3qkYOUpXF9VFW2Lra2zKoQ=" -> "FeUQf6bVCq7b3Y6oC6LvUUbY+CrvxYrNqBDM7a82fAA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9CBtcCh+khAXW/zd6pEp1Bok0sqX1YFYbvRvdT1PHE=" -> "ga0DZYzlDWmFgXF4o3EOgKzwdHHIiuN0aolXF+08SC0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "LDA67S1nSq2oZgjLN4yI+RszXHWfX6oTN47dst398O8=" -> "+rUcq5Nx+7iCnmGRb2bQdslrITc80ajJ+m5VXUYGk3M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-15T20:57:31Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "y2uxop" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-15T20:57:30Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-15T20:57:29Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*